samples/uplane-vms/test-12-29-13-666662/stress.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: test_http.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 1m30s max duration (incl. graceful stop):
           * default: 1 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 1/1 VUs, 747 complete and 0 interrupted iterations
default   [   2% ] 1 VUs  0m01.0s/1m0s

running (0m02.0s), 1/1 VUs, 1448 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  0m02.0s/1m0s

running (0m03.0s), 1/1 VUs, 2127 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m03.0s/1m0s

running (0m04.0s), 1/1 VUs, 2765 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  0m04.0s/1m0s

running (0m05.0s), 1/1 VUs, 3354 complete and 0 interrupted iterations
default   [   8% ] 1 VUs  0m05.0s/1m0s

running (0m06.0s), 1/1 VUs, 3956 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  0m06.0s/1m0s

running (0m07.0s), 1/1 VUs, 4572 complete and 0 interrupted iterations
default   [  12% ] 1 VUs  0m07.0s/1m0s

running (0m08.0s), 1/1 VUs, 5187 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  0m08.0s/1m0s

running (0m09.0s), 1/1 VUs, 5778 complete and 0 interrupted iterations
default   [  15% ] 1 VUs  0m09.0s/1m0s

running (0m10.0s), 1/1 VUs, 6322 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  0m10.0s/1m0s

running (0m11.0s), 1/1 VUs, 6905 complete and 0 interrupted iterations
default   [  18% ] 1 VUs  0m11.0s/1m0s

running (0m12.0s), 1/1 VUs, 7517 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  0m12.0s/1m0s

running (0m13.0s), 1/1 VUs, 8138 complete and 0 interrupted iterations
default   [  22% ] 1 VUs  0m13.0s/1m0s

running (0m14.0s), 1/1 VUs, 8740 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  0m14.0s/1m0s

running (0m15.0s), 1/1 VUs, 9317 complete and 0 interrupted iterations
default   [  25% ] 1 VUs  0m15.0s/1m0s

running (0m16.0s), 1/1 VUs, 9892 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  0m16.0s/1m0s

running (0m17.0s), 1/1 VUs, 10491 complete and 0 interrupted iterations
default   [  28% ] 1 VUs  0m17.0s/1m0s

running (0m18.0s), 1/1 VUs, 11076 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  0m18.0s/1m0s

running (0m19.0s), 1/1 VUs, 11642 complete and 0 interrupted iterations
default   [  32% ] 1 VUs  0m19.0s/1m0s

running (0m20.0s), 1/1 VUs, 12204 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  0m20.0s/1m0s

running (0m21.0s), 1/1 VUs, 12789 complete and 0 interrupted iterations
default   [  35% ] 1 VUs  0m21.0s/1m0s

running (0m22.0s), 1/1 VUs, 13417 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  0m22.0s/1m0s

running (0m23.0s), 1/1 VUs, 13971 complete and 0 interrupted iterations
default   [  38% ] 1 VUs  0m23.0s/1m0s

running (0m24.0s), 1/1 VUs, 14604 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  0m24.0s/1m0s

running (0m25.0s), 1/1 VUs, 15254 complete and 0 interrupted iterations
default   [  42% ] 1 VUs  0m25.0s/1m0s

running (0m26.0s), 1/1 VUs, 15864 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  0m26.0s/1m0s

running (0m27.0s), 1/1 VUs, 16447 complete and 0 interrupted iterations
default   [  45% ] 1 VUs  0m27.0s/1m0s

running (0m28.0s), 1/1 VUs, 17080 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  0m28.0s/1m0s

running (0m29.0s), 1/1 VUs, 17704 complete and 0 interrupted iterations
default   [  48% ] 1 VUs  0m29.0s/1m0s

running (0m30.0s), 1/1 VUs, 18273 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  0m30.0s/1m0s

running (0m31.0s), 1/1 VUs, 18901 complete and 0 interrupted iterations
default   [  52% ] 1 VUs  0m31.0s/1m0s

running (0m32.0s), 1/1 VUs, 19626 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  0m32.0s/1m0s

running (0m33.0s), 1/1 VUs, 20333 complete and 0 interrupted iterations
default   [  55% ] 1 VUs  0m33.0s/1m0s

running (0m34.0s), 1/1 VUs, 20939 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  0m34.0s/1m0s

running (0m35.0s), 1/1 VUs, 21550 complete and 0 interrupted iterations
default   [  58% ] 1 VUs  0m35.0s/1m0s

running (0m36.0s), 1/1 VUs, 22120 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  0m36.0s/1m0s

running (0m37.0s), 1/1 VUs, 22661 complete and 0 interrupted iterations
default   [  62% ] 1 VUs  0m37.0s/1m0s

running (0m38.0s), 1/1 VUs, 23216 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  0m38.0s/1m0s

running (0m39.0s), 1/1 VUs, 23767 complete and 0 interrupted iterations
default   [  65% ] 1 VUs  0m39.0s/1m0s

running (0m40.0s), 1/1 VUs, 24296 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  0m40.0s/1m0s

running (0m41.0s), 1/1 VUs, 24830 complete and 0 interrupted iterations
default   [  68% ] 1 VUs  0m41.0s/1m0s

running (0m42.0s), 1/1 VUs, 25374 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  0m42.0s/1m0s

running (0m43.0s), 1/1 VUs, 25979 complete and 0 interrupted iterations
default   [  72% ] 1 VUs  0m43.0s/1m0s

running (0m44.0s), 1/1 VUs, 26569 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  0m44.0s/1m0s

running (0m45.0s), 1/1 VUs, 27120 complete and 0 interrupted iterations
default   [  75% ] 1 VUs  0m45.0s/1m0s

running (0m46.0s), 1/1 VUs, 27671 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  0m46.0s/1m0s

running (0m47.0s), 1/1 VUs, 28290 complete and 0 interrupted iterations
default   [  78% ] 1 VUs  0m47.0s/1m0s

running (0m48.0s), 1/1 VUs, 28910 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  0m48.0s/1m0s

running (0m49.0s), 1/1 VUs, 29559 complete and 0 interrupted iterations
default   [  82% ] 1 VUs  0m49.0s/1m0s

running (0m50.0s), 1/1 VUs, 30175 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  0m50.0s/1m0s

running (0m51.0s), 1/1 VUs, 30871 complete and 0 interrupted iterations
default   [  85% ] 1 VUs  0m51.0s/1m0s

running (0m52.0s), 1/1 VUs, 31536 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  0m52.0s/1m0s

running (0m53.0s), 1/1 VUs, 32124 complete and 0 interrupted iterations
default   [  88% ] 1 VUs  0m53.0s/1m0s

running (0m54.0s), 1/1 VUs, 32655 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  0m54.0s/1m0s

running (0m55.0s), 1/1 VUs, 33281 complete and 0 interrupted iterations
default   [  92% ] 1 VUs  0m55.0s/1m0s

running (0m56.0s), 1/1 VUs, 33856 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  0m56.0s/1m0s

running (0m57.0s), 1/1 VUs, 34423 complete and 0 interrupted iterations
default   [  95% ] 1 VUs  0m57.0s/1m0s

running (0m58.0s), 1/1 VUs, 34999 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  0m58.0s/1m0s

running (0m59.0s), 1/1 VUs, 35616 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  0m59.0s/1m0s

running (1m00.0s), 1/1 VUs, 36199 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  1m00.0s/1m0s

running (1m00.0s), 0/1 VUs, 36200 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  1m0s

     data_received..................: 61 MB  1.0 MB/s
     data_sent......................: 3.0 MB 50 kB/s
     http_req_blocked...............: avg=538.62µs min=240.73µs med=517.39µs max=13.81ms p(90)=666.9µs  p(95)=719.42µs
     http_req_connecting............: avg=499.63µs min=221.89µs med=478.32µs max=13.52ms p(90)=623.3µs  p(95)=672.99µs
     http_req_duration..............: avg=1.06ms   min=556.77µs med=1.04ms   max=15.32ms p(90)=1.27ms   p(95)=1.36ms  
       { expected_response:true }...: avg=1.06ms   min=556.77µs med=1.04ms   max=15.32ms p(90)=1.27ms   p(95)=1.36ms  
     http_req_failed................: 0.00%  ✓ 0         ✗ 36200
     http_req_receiving.............: avg=73.78µs  min=19µs     med=66.21µs  max=10.37ms p(90)=122.75µs p(95)=141.18µs
     http_req_sending...............: avg=35.03µs  min=12.84µs  med=32.84µs  max=3.45ms  p(90)=46.94µs  p(95)=56.82µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=956.64µs min=451.62µs med=936.17µs max=14.43ms p(90)=1.15ms   p(95)=1.23ms  
     http_reqs......................: 36200  603.31689/s
     iteration_duration.............: avg=1.64ms   min=877.44µs med=1.61ms   max=16.01ms p(90)=1.97ms   p(95)=2.11ms  
     iterations.....................: 36200  603.31689/s
     vus............................: 1      min=1       max=1  
     vus_max........................: 1      min=1       max=1